apps/api/artillery.yml
config:
    target: http://localhost:8000
    phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 5
          name: Warm up
        - duration: 60
          arrivalRate: 5
          rampTo: 10
          name: Ramp up
        - duration: 60
          arrivalRate: 10
          rampTo: 25
          name: Spike
    plugins:
        # ensure:
        #     thresholds:
        #         - http.response_time.p99: 100
        #         - http.response_time.p95: 75
        apdex:
            threshold: 100
        metrics-by-endpoint: {}

scenarios:
    - flow:
          - loop:
                - get:
                      url: "/"
            count: 100